{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_1",
    "layers": [
      {
        "class_name": "Dense",
        "config": {
          "units": 8,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "name": "dense_Dense1",
          "trainable": true,
          "batch_input_shape": [null, 3],
          "dtype": "float32"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "name": "dense_Dense2",
          "trainable": true
        }
      }
    ]
  },
  "keras_version": "tfjs-layers 4.22.0",
  "backend": "tensor_flow.js"
}
